<h2 id="section4-10">4-10 Написать программу, которая выводит таблицу итераций при обходе массива, с подсветкой итераций</h2>

<p>Эта программа выводит таблицу, в которой отображаются итерации при обходе массива.</p>

<h3>Пример кода:</h3>
<pre class="line-numbers"><code class="language-java">public class IterationTableExample &#123;
    public static void main(String[] args) &#123;
        int[] array = &#123;1, 2, 3, 4, 5&#125;;
        System.out.println("Итерация\tЗначение");
        for (int i = 0; i < array.length; i++) &#123;
            System.out.println(i + "\t\t" + array[i]);
        &#125;
    &#125;
&#125;</code></pre>

<p>Вывод программы:</p>
<pre><code>Итерация    Значение
0           1
1           2
2           3
3           4
4           5</code></pre>

<!-- Блок для видео с YouTube -->
<h2>Смотрите видео ниже:</h2>
<div class="video-container">
  <iframe src="https://www.youtube.com/embed/N8cK-lxUROY?start=0" allowfullscreen></iframe>
</div>
