<h2 id="section4-11">4-11 Написать программу, которая подсвечивает значения при сортировке массива по возрастанию. (Пузырьковая сортировка)</h2>

<p>Эта программа использует пузырьковую сортировку для сортировки массива и отображает каждый шаг сортировки.</p>

<h3>Пример кода:</h3>
<pre class="line-numbers"><code class="language-java">public class BubbleSortExample &#123;
    public static void main(String[] args) &#123;
        int[] array = &#123;5, 2, 9, 1, 5, 6&#125;;
        boolean swapped;
        do &#123;
            swapped = false;
            for (int i = 0; i < array.length - 1; i++) &#123;
                if (array[i] > array[i + 1]) &#123;
                    int temp = array[i];
                    array[i] = array[i + 1];
                    array[i + 1] = temp;
                    swapped = true;
                    // Выводим шаг сортировки
                    System.out.println("Шаг сортировки: " + java.util.Arrays.toString(array));
                &#125;
            &#125;
        &#125; while (swapped);
    &#125;
&#125;</code></pre>

<p>Вывод программы:</p>
<pre><code>Шаг сортировки: [2, 5, 1, 5, 6, 9]
Шаг сортировки: [2, 1, 5, 5, 6, 9]
Шаг сортировки: [1, 2, 5, 5, 6, 9]</code></pre>

<!-- Блок для видео с YouTube -->
<h2>Смотрите видео ниже:</h2>
<div class="video-container">
  <iframe src="https://www.youtube.com/embed/N8cK-lxUROY?start=0" allowfullscreen></iframe>
</div>
